УТ_для_edt/src/Enums/CRM_ВариантыПоставки/CRM_ВариантыПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыПоставки</name>
  <enumValues>
    <name>СТАРТ</name>
  </enumValues>
  <enumValues>
    <name>ПРОФ</name>
  </enumValues>
  <enumValues>
    <name>КОРП</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_Решения/CRM_Решения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Решения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор решения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВложений</name>
    <comment>Источник вложений</comment>
    <type>
      <types>CatalogRef.CRM_Решения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКатегория</name>
    <comment>Основная категория</comment>
    <type>
      <types>CatalogRef.CRM_КатегорииРешений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <comment>Проект/процесс</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРешения</name>
    <comment>Статус решения</comment>
    <type>
      <types>EnumRef.CRM_СтатусыРешений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопроса</name>
    <comment>Текст вопроса</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопросаHTML</name>
    <comment>Текст вопроса в формате HTML</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаименованияРешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Категории</name>
    <comment>Категории</comment>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.CRM_КатегорииРешений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответы</name>
    <comment>Ответы</comment>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АвторИзменения</name>
      <comment>Автор изменения</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтвета</name>
      <comment>Вариант ответа</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтветаHTML</name>
      <comment>Вариант ответа в формате HTML</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОтвета</name>
      <comment>Наименование ответа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОтвета</name>
      <comment>Статус ответа</comment>
      <type>
        <types>EnumRef.CRM_СтатусыРешений</types>
      </type>
    </attributes>
    <attributes>
      <name>удалитьCRM_НомерСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заметки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметЗаметок</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСодержания</name>
    <comment>Реквизит для полнотекстового поиска</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляРабочегоСтола</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <type>
      <types>EnumRef.ЦветаЗаметок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПредмета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаметки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЗаметкаЛенты</name>
    <comment>Служебный реквизит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартИсточник</name>
    <comment>//++ #1624 смарт: Фролов 14.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.</comment>
    <type>
      <types>DocumentRef.смартЛид</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСовет</name>
    <comment>//++ #1698 смарт: Фролов 27.03.2024 //Оповещение Маркетинга и Коммерции о результатах обработки интереса менеджером.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартКвалификация</name>
    <comment>//++ #1833 смарт: Фролов 27.05.2024 //Автоматическое создание заметок при квалификации интереса.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПартнер</name>
    <comment>//++ #1981 смарт: Фролов 21.08.2024 //Показ заметок по результатам квалификации Интереса в карточке Партнера.</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>смартСтатусыВзаимоотношенийСКлиентомПоЗаметке</name>
    <comment>//++ #1313 смарт: Фролов 15.02.2023 //смартСтатусыВзаимоотношенийСКлиентомПоЗаметке</comment>
    <attributes>
      <name>смартСтатусВзаимоотношенийСКлиентом</name>
      <comment>//++ #1313 смарт: Фролов 15.02.2023 //смартСтатусыВзаимоотношенийСКлиентомПоЗаметке</comment>
      <type>
        <types>CatalogRef.смартСтатусыВзаимоотношенийСКлиентами</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_УТ_ОбновлениеИнформационнойБазы/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы УтиВСК.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах Интернет-поддержки.
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя	= "УправлениеТорговлей_CRM_2";
	Описание.Версия = "3.0.22.20";
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	Описание.ИдентификаторИнтернетПоддержки = "tradeCRM";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "CRM_УТ_ОбновлениеИнформационнойБазы.ПервыйЗапуск";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.CRM_УсловияСрабатыванияТриггеров.СоздатьПредопределенныеДействия";
	Обработчик.Комментарий = НСтр("ru = 'Обновление предопределенных условий триггеров.'");
 	 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.CRM_ДействияТриггеров.СоздатьПредопределенныеДействия";
	Обработчик.Комментарий = НСтр("ru = 'Обновление предопределенных действий триггеров.'");
	
	 // 3.0.18.31
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.18.31";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.CRM_ШаблоныАвтотекста.ЗаполнитьПредопределенныеДанные";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение шаблонов автотекста'");
	
	// 3.0.18.33
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.18.33";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("16fe5f7e-82b9-411f-8116-5329fe69dccc");
	Обработчик.Комментарий = НСтр("ru='Заполнение пустых текстов вопросов в решениях'");
	Обработчик.Процедура = "CRM_УТ_ОбновлениеИнформационнойБазы.ЗаполнитьПустыеТекстыВопросовВРешениях";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_УТ_ОбновлениеИнформационнойБазы.ЗарегистрироватьРешенияСПустымиТекстамиВопросов";
	Обработчик.ЧитаемыеОбъекты      = "Справочник.CRM_Решения";
	Обработчик.ИзменяемыеОбъекты    = "Справочник.CRM_Решения";
	Обработчик.БлокируемыеОбъекты   = "Справочник.CRM_Решения";
	Обработчик.ПроцедураПроверки    = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	 // 3.0.18.34
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.18.34";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.CRM_ШаблоныАвтотекста.ЗаполнитьПредопределенныеДанные";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение шаблонов автотекста'");
	
	// 3.0.18.37
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.18.37";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ae77df43-d593-44c5-8f89-c22a3aa0a480");
	Обработчик.Комментарий = НСтр("ru='Обновление условий срабатывания триггеров'");
	Обработчик.Процедура = "CRM_Модуль_ОбновлениеИнформационнойБазы.ОбработатьУсловияСрабатыванияТриггеровПриПереходеНаНовуюВерсию";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_Модуль_ОбновлениеИнформационнойБазы.ПроцедураЗаглушка";
	Обработчик.ЧитаемыеОбъекты      = "Справочник.CRM_УсловияСрабатыванияТриггеров, Справочник.CRM_Триггеры";
	Обработчик.ИзменяемыеОбъекты    = "Справочник.CRM_УсловияСрабатыванияТриггеров, Справочник.CRM_Триггеры";
	Обработчик.БлокируемыеОбъекты   = "Справочник.CRM_УсловияСрабатыванияТриггеров, Справочник.CRM_Триггеры";
	Обработчик.ПроцедураПроверки    = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	// 3.0.19.42
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.19.42";
	Обработчик.Комментарий = НСтр("ru = 'Обновляем правила регистрации объектов для iCRM.'");
	Обработчик.Процедура = "ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.ОбновитьПравилаРегистрации";
	Обработчик.РежимВыполнения = "Монопольно";
	
	// 3.0.19.44
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.19.44";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.CRM_ШаблоныАвтотекста.ЗаполнитьПредопределенныеДанные";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполнение шаблонов автотекста'");
	
	// 3.0.22.6
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "CRM_УТ_ОбновлениеИнформационнойБазы.ОбработатьЗаметкиДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "3.0.22.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("53c1528c-cf7e-4ed7-b4fb-40899e3a5a42");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_УТ_ОбновлениеИнформационнойБазы.ЗарегистрироватьЗаметкиКОбработке";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение служебного признака отборажения в ленте для заметок по клиентам, контактным лицам и интересам.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.Заметки.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.Заметки.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Справочники.Заметки.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры // ПередОбновлениемИнформационнойБазы()

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПослеОбновленияИнформационнойБазы.
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсияИБ, Знач ТекущаяВерсияИБ,
	Знач ИтерацииОбновления, ВыводитьОписаниеОбновлений, Знач МонопольныйРежим) Экспорт
	
КонецПроцедуры // ПослеОбновленияИнформационнойБазы

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры // ПриПодготовкеМакетаОписанияОбновлений()

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры // ПриОпределенииРежимаОбновленияДанных()

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
#Область ТиповыеРешения

	Обработчик = Обработчики.Добавить();
	Обработчик.ПредыдущееИмяКонфигурации = "УправлениеТорговлей";
	Обработчик.Процедура = "CRM_УТ_ОбновлениеИнформационнойБазы.ПереходСТиповогоРешения";

#КонецОбласти

#Область ОбъединенныеРешения

	Обработчик = Обработчики.Добавить();
	Обработчик.ПредыдущееИмяКонфигурации = "УправлениеТорговлей_CRM_2";
	Обработчик.Процедура = "CRM_УТ_ОбновлениеИнформационнойБазы.ПереходСОбъединенногоРешения";

#КонецОбласти

КонецПроцедуры // ПриДобавленииОбработчиковПереходаСДругойПрограммы()

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("ОчиститьСведенияОПредыдущейКонфигурации") Тогда
		Параметры.ОчиститьСведенияОПредыдущейКонфигурации = Ложь;
	КонецЕсли;
	
	// Снимем флаг "ЭтоОсновнаяКонфигурация" с подсистемы "УправлениеТорговлей" (ПредыдущееИмяКонфигурации)
	ОбновлениеИнформационнойБазы.УстановитьВерсиюИБ(ПредыдущееИмяКонфигурации, ПредыдущаяВерсияКонфигурации, Ложь);
	
КонецПроцедуры // ПриЗавершенииПереходаСДругойПрограммы()

// Получить режим обновления данных информационной базы
//
// Возвращаемое значение:
//   Строка
//
Функция ПолучитьРежимОбновленияДанных() Экспорт
	Возврат ОбновлениеИнформационнойБазыСлужебный.РежимОбновленияДанных();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервыйЗапуск

// Установка варианта поставки
//
Процедура УстановитьВариантПоставки()
	
	Константы.CRM_ОсновнойВариантПоставки.Установить(Перечисления.CRM_ВариантыПоставки.ПРОФ);
	
КонецПроцедуры // УстановитьВариантПоставки()

// Процедура заполняет пустую ИБ.
//
// Параметры:
//	Нет.
//
Процедура ПервыйЗапуск() Экспорт
	
	НачатьТранзакцию();
	
	УстановитьВариантПоставки();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ПервыйЗапуск()

// Процедура перехода с ТиповогоРешения
//
// Параметры:
//	Нет.
//
Процедура ПереходСТиповогоРешения() Экспорт
	
	НачатьТранзакцию();
	
	УстановитьВариантПоставки();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ПереходСТиповогоРешения()

// Процедура перехода с Объединенного решения 2.0
//
// Параметры:
//	Нет.
//
Процедура ПереходСОбъединенногоРешения() Экспорт
	
	НачатьТранзакцию();
	
	УстановитьВариантПоставки();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ПереходСОбъединенногоРешения()

#КонецОбласти

#Область ПроцедурыОбновления

#Область Обновление_3_0_18_33

Процедура ЗаполнитьПустыеТекстыВопросовВРешениях(Параметры) Экспорт
	
	ОбработкаЗавершена = Истина;
	
	Выборка = CRM_ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, "Справочник.CRM_Решения",, 10000);
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.CRM_Решения");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			
			БлокировкаДанных.Заблокировать();
			
			ТекущийОбъектТекстВопроса = Взаимодействия.ПолучитьОбычныйТекстИзHTML(Выборка.Ссылка.ТекстВопросаHTML);
			
			Если НЕ ПустаяСтрока(ТекущийОбъектТекстВопроса) Тогда
				
				ОбновляемоеРешение = Выборка.Ссылка.ПолучитьОбъект();
				ОбновляемоеРешение.ТекстВопроса = ТекущийОбъектТекстВопроса;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбновляемоеРешение);
				
			КонецЕсли;	
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			// Если не удалось обработать какой-либо документ, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось обработать элемент справочника: %1 по причине: %2'"), 
				Выборка.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Выборка.Ссылка.Метаданные(), Выборка.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Если Не ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, "Справочник.CRM_Решения") Тогда
		ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Процедуре CRM_ОбновлениеИнформационнойБазы.ЗаполнитьПустыеТекстыВопросовВРешениях не удалось обработать (пропущены): %1'"), 
		ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
		, ,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Процедура CRM_ОбновлениеИнформационнойБазы.ЗаполнитьПустыеТекстыВопросовВРешениях обработала очередную порцию элементов справочника: %1'"),
		ОбъектовОбработано));
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

Процедура ЗарегистрироватьРешенияСПустымиТекстамиВопросов(Параметры) Экспорт
	
	ОтработаныВсеЗадачи = Ложь;
	Ссылка = "";
	
	Пока Не ОтработаныВсеЗадачи Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1000
			|	CRM_Решения.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.CRM_Решения КАК CRM_Решения
			|ГДЕ
			|	CRM_Решения.Ссылка > &Ссылка
			|	И (ВЫРАЗИТЬ(CRM_Решения.ТекстВопроса КАК СТРОКА(10))) = """"
			|
			|УПОРЯДОЧИТЬ ПО
			|	Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
		
		КоличествоСсылок = МассивСсылок.Количество();
		Если КоличествоСсылок < 1000 Тогда
			ОтработаныВсеЗадачи = Истина;
		КонецЕсли;
		
		Если КоличествоСсылок > 0 Тогда
			Ссылка = МассивСсылок[КоличествоСсылок - 1];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // Обновление_3_0_18_33

#Область Обновление_3_0_19_44
Процедура ЗарегистрироватьКоммерческиеПредложенияКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОтработаныВсеЗадачи = Ложь;
	Ссылка = "";
	
	Пока Не ОтработаныВсеЗадачи Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	КоммерческоеПредложениеКлиенту.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
		|ГДЕ
		|	КоммерческоеПредложениеКлиенту.Ссылка > &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
		
		КоличествоСсылок = МассивСсылок.Количество();
		Если КоличествоСсылок < 1000 Тогда
			ОтработаныВсеЗадачи = Истина;
		КонецЕсли;
		
		Если КоличествоСсылок > 0 Тогда
			Ссылка = МассивСсылок[КоличествоСсылок - 1];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьКоммерческоеПредложениеКлиентуПриПереходеНаНовуюВерсию(Параметры) Экспорт
	
	ОбработкаЗавершена = Истина;
	
	Выборка = CRM_ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, "Документ.КоммерческоеПредложениеКлиенту",, 10000);
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.КоммерческоеПредложениеКлиенту");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			
			БлокировкаДанных.Заблокировать();
			
				
			ОбновляемыйКП = Выборка.Ссылка.ПолучитьОбъект();
			ОбновляемыйКП.ПрочаяДополнительнаяИнформацияТекст = ОбновляемыйКП.ПрочаяДополнительнаяИнформацияТекст + "
			|" + ОбновляемыйКП.CRM_Примечание;
			Для Каждого Строка Из ОбновляемыйКП.Товары Цикл
				Если ТипЗнч(Строка.Номенклатура) = Тип("СправочникСсылка.CRM_Разделители") Тогда Продолжить конецЕсли;
				Строка.CRM_Содержание = Строка.Номенклатура.НаименованиеПолное + ?(Строка.Характеристика.Пустая(), "", " ("+Строка.Характеристика.НаименованиеПолное+")");
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбновляемыйКП);
				
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			// Если не удалось обработать какой-либо документ, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось обработать документ: %1 по причине: %2'"), 
				Выборка.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Выборка.Ссылка.Метаданные(), Выборка.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Если Не ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, "Документ.КоммерческоеПредложениеКлиенту") Тогда
		ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Процедуре CRM_УТ_ОбновлениеИнформационнойБазы.ОбработатьКоммерческоеПредложениеКлиентуПриПереходеНаНовуюВерсию не удалось обработать (пропущены): %1'"), 
		ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
		, ,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Процедура CRM_УТ_ОбновлениеИнформационнойБазы.ОбработатьКоммерческоеПредложениеКлиентуПриПереходеНаНовуюВерсию обработала очередную порцию документов: %1'"),
		ОбъектовОбработано));
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

#КонецОбласти // Обновление_3_0_19_44

#Область Обновление_3_0_22_6

Процедура ЗарегистрироватьЗаметкиКОбработке(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заметки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Заметки КАК Заметки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Заметки.Предмет) В (&ТипыОбъектовЛенты)
	|	И НЕ Заметки.CRM_ЗаметкаЛенты";
	
	ТипыОбъектовЛенты = Новый Массив;
	ТипыОбъектовЛенты.Добавить(Тип("СправочникСсылка.Партнеры"));
	ТипыОбъектовЛенты.Добавить(Тип("СправочникСсылка.КонтактныеЛицаПартнеров"));
	ТипыОбъектовЛенты.Добавить(Тип("ДокументСсылка.CRM_Интерес"));
	Запрос.УстановитьПараметр("ТипыОбъектовЛенты", ТипыОбъектовЛенты);
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьЗаметкиДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Справочник.Заметки";
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			СправочникОбъект.CRM_ЗаметкаЛенты = Истина;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Выборка.Ссылка);
			
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);		
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#КонецОбласти // СлужебныеПроцедурыИФункции
